app/Controllers/Caja.php

    public function verRegistro($id)
    {
        $caja = $this->caja->getResultado($id);
---
SELECT *
FROM `caja`