app/Controllers/Usuarios.php

SELECT *
FROM `usuario`
---
    public function index()
    {
        $data['titulo'] = "Usuarios";
        $data['contenido'] = 'usuarios/usuarios';
        $data["usuario"] = $this->usuario->findAll();